#+TITLE: Alex Ameen's Core C Library

* Snippets
#+BEGIN_SRC C :results output
#include <stdlib.h>
#include <stdio.h>
#include <limits.h>

  int
main( int argc, char * argv[], char ** envp )
{
  printf( "%d\n", CHAR_MIN );
  printf( "%d\n", CHAR_MAX );
  printf( "%u\n", UCHAR_MAX );
  return EXIT_SUCCESS;
}
#+END_SRC

#+RESULTS:
: -128
: 127
: 255d

sqrt( LONG_MAX ) = 3037000499
